Tekla Open API Reference for Tekla Structures 2025
ComponentItem.Select Method
Overload List
Name | Description
Select(String, Int32)
 Selects the component item from the component database. Uses the type if defined for selection
Select(String, Int32, ComponentItem.ComponentTypeEnum)
 Selects the component item from the component database.
Top
See Also
Reference
ComponentItem Class
Tekla.Structures.Catalogs Namespace